import { AboutMe } from "@/types/data";

export const aboutMeData : AboutMe[] = [
    {
        title: '01. 서비스 전체를 이해하는 개발자',
        description:'기획·웹운영·QA·개발을 아우르는 인턴 경험을 통해 단순히 코드를 구현하는 것을 넘어, 서비스가 사용자에게 전달되는 전 과정을 이해하며 개발합니다.'
    },
    {
        title: '02. 사용자 경험에서 고민하는 개발자',
        description: 'QA와 운영 업무를 통해 실제 사용자 흐름을 직접 검증한 경험을 바탕으로, 예측할 수 없는 다양한 상황에서도 사용자 경험을 향상시키기 위해 고민합니다.'
    },
    {
        title: '03. 재사용성을 고민하는 개발자',
        description: '팀원들과의 컨벤션 및 규칙을 엄격하게 지정하고, 재사용 가능한 컴포넌트와 확장 가능한 구조를 고민하며 개발합니다.'
    }
]